/**
@file num_to_str.h
@author Хоменко К., гр. 515-в
@date 21 серпня 2022р.
@brief Навчальна практика.
*/

#ifndef num_so_str_h
#define num_so_str_h

#include "sds.h"
#include <stdlib.h>

//струткра, яка відповідає за тектове представлення числа
typedef struct
{
    int value;
    sds name;
} number;

//константа, у якій зберігаються текстові представлення чисел
const number numbers[] = {
    {0,
     "нуль"},
    {1,
     "один"},
    {2,
     "два"},
    {3,
     "три"},
    {4,
     "чотири"},
    {5,
     "пʼять"},
    {6,
     "шість"},
    {7,
     "сім"},
    {8,
     "вісім"},
    {9,
     "девʼять"},
    {10,
     "десять"},
    {11,
     "одинадцять"},
    {12,
     "дванадцять"},
    {13,
     "тринадцять"},
    {14,
     "чотирнадцять"},
    {15,
     "пʼятнадцять"},
    {16,
     "шістнадцять"},
    {17,
     "сімнадцять"},
    {18,
     "вісімнадцять"},
    {19,
     "девʼятнадцять"},
    {20,
     "двадцять"},
    {30,
     "тридцять"},
    {40,
     "сорок"},
    {50,
     "пʼятдесят"},
    {60,
     "шістдесят"},
    {70,
     "сімдесят"},
    {80,
     "вісімдесят"},
    {90,
     "девʼяносто"},
    {100,
     "сто"},
    {200,
     "двісті"},
    {300,
     "триста"},
    {400,
     "чотириста"},
    {500,
     "пʼятсот"},
    {600,
     "шістсот"},
    {700,
     "сімсот"},
    {800,
     "вісімсот"},
    {900,
     "девʼятсот"}};

//константа, язка зберігає кількість елементів у масиві значень
const int length = sizeof(numbers) / sizeof(numbers[0]);

/**
 * Переводить цілочисленне число у рядок.
 * @param *number цілочисленне число для переводу у рядок.
 * @return число, переведене у рядок.
 */
sds GetNumberName(int number);

#endif
